0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: The Open Source CFD Toolbox            |
| \\      /  Field         | Version:  10                                     |
|  \\    /   Operation     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            nutUWallFunction;
        value           uniform 0;
    }
    drone
    {
        type            nutUWallFunction;
        value           uniform 0;
    }
    blades
    {
        type            nutUWallFunction;
        value           uniform 0;
    }
}