0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: The Open Source CFD Toolbox            |
| \\      /  Field         | Version: 10                                      |
|  \\    /   Operation     |                                                 |
|   \\  /    And           |                                                 |
|    \\/     Manipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// ************************************************************************* //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 10;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
    drone
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
    blades
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
}
// ************************************************************************* //