0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    drone
    {
        type            calculated;
        value           nonuniform List<vector> 
70116
(
(-0.451394 0.0106316 0.0300827)
(-0.512765 0.101366 0.0672799)
(-0.448275 0.00621026 0.0432466)
(-0.375966 0.00415501 0.0351372)
(-0.466621 -0.0937816 0.0474969)
(-0.277339 -0.000124113 -0.00277097)
(-0.4174 -0.141953 -0.00967104)
(-0.45328 0.140808 0.000952992)
...
)
;
    }
    blades
    {
        type            calculated;
        value           nonuniform List<vector> 
25853
(
(-0.344772 0.0244164 0.00602483)
(-0.369242 -0.0406495 -0.0526279)
(-0.449657 -0.0436177 0.0763294)
(-0.45148 -0.0643797 -0.137886)
(-0.468273 -0.0331943 -0.0877185)
(-0.472528 -0.0256037 -0.106891)
(-0.491608 -0.0199384 -0.0189605)
(-0.445939 0.00924554 0.0820204)
...
)
;
    }
}


// ************************************************************************* //
