constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: The Open Source CFD Toolbox            |
| \\      /  Field         | Version:  10                                     |
|  \\    /   Operation     |                                                 |
|   \\  /    And           |                                                 |
|    \\/     Manipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}

simulationType  RAS;

RAS
{
    RASModel    kOmegaSSTSAS;
    turbulence  on;
    printCoeffs on;
    delta           cubeRootVol;
}

model           Newtonian;
nu              nu [0 2 -1 0 0 0 0] 1.5e-5;