constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  Field         | OpenFOAM: The Open Source CFD Toolbox            |
|  \\    /   Operation     | Version:  10                                     |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

viscosityModel    Newtonian;
rho             rho [1 -3 0 0 0 0 0] 1.225;
nu              nu [0 2 -1 0 0 0 0] 1.5e-5;