constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
rho             rho [1 -3 0 0 0 0 0] 1.225;
nu              nu [0 2 -1 0 0 0 0] 1.5e-5;