system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    (-2.9228   -9.8428   -1.9171)   // 0: лівий нижній задній кут
    ( 3.0772   -9.8428   -1.9171)   // 1: правий нижній задній кут
    ( 3.0772    10.1572  -1.9171)   // 2: правий нижній передній кут
    (-2.9228    10.1572  -1.9171)   // 3: лівий нижній передній кут

    (-2.9228   -9.8428    3.2829)   // 4: лівий верхній задній кут
    ( 3.0772   -9.8428    3.2829)   // 5: правий верхній задній кут
    ( 3.0772    10.1572   3.2829)   // 6: правий верхній передній кут
    (-2.9228    10.1572   3.2829)   // 7: лівий верхній передній кут
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 100 25) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);