system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;

startFrom       latestTime;
startTime       0;

stopAt          endTime;
endTime         1;

deltaT          0.001;

writeControl    timeStep;
writeInterval   50;

purgeWrite      0;

functions
{
    wallShearStress
    {
        type            wallShearStress;
        functionObjectLibs ("libfieldFunctionObjects.so");
        // Коли виводити результати: кожен часовий крок або за заданим інтервалом
        outputControl   timeStep;
        outputInterval  50;  // кожен крок, можна змінити за потреби

        // Перелічіть патчі, для яких необхідно обчислювати wall shear stress
        patches         (drone blades);
    }
}
